readme.org
#+Title: Emacs configuration

#+STARTUP: show3levels
#+PROPERTY: header-args:emacs-lisp :comments link

* early-init.el and init.el

** early-init.el

#+BEGIN_SRC emacs-lisp :tangle early-init.el
  ;;; early-init.el --- Early Init File -*- lexical-binding: t; no-byte-compile: t -*-

  ;; Defer garbage collection further back in the startup process
  (setq gc-cons-threshold most-positive-fixnum
	gc-cons-percentage 0.6)

  ;; In Emacs 27+, package initialization occurs before `user-init-file' is
  ;; loaded, but after `early-init-file'. Doom handles package initialization, so
  ;; we must prevent Emacs from doing it early!
  (setq package-enable-at-startup nil)
  ;; Do not allow loading from the package cache (same reason).
  (setq package-quickstart nil)

  ;; Prevent the glimpse of un-styled Emacs by disabling these UI elements early.
  (push '(menu-bar-lines . 0) default-frame-alist)
  (push '(tool-bar-lines . 0) default-frame-alist)
  (push '(vertical-scroll-bars) default-frame-alist)

  ;; Resizing the Emacs frame can be a terribly expensive part of changing the
  ;; font. By inhibiting this, we easily halve startup times with fonts that are
  ;; larger than the system default.
  (setq frame-inhibit-implied-resize t)

  ;; Disable GUI elements
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (setq inhibit-splash-screen t)
  (setq use-file-dialog nil)

  ;; Prevent unwanted runtime builds in gccemacs (native-comp); packages are
  ;; compiled ahead-of-time when they are installed and site files are compiled
  ;; when gccemacs is installed.
  (setq comp-deferred-compilation nil)

  ;; Mitigate https://debbugs.gnu.org/cgi/bugreport.cgi?bug=57849
  (when (eq system-type 'darwin)
    (setq native-comp-driver-options '("-Wl,-w")))
#+END_SRC

** init.el: startup optimization

#+BEGIN_SRC emacs-lisp :tangle init.el
  ;;; init.el --- Personal configuration file -*- lexical-binding: t; no-byte-compile: t; -*-

  ;; `file-name-handler-alist' is consulted on every `require', `load' and various
  ;; path/io functions. You get a minor speed up by nooping this. However, this
  ;; may cause problems on builds of Emacs where its site lisp files aren't
  ;; byte-compiled and we're forced to load the *.el.gz files (e.g. on Alpine)
  (unless (daemonp)
    (defvar doom--initial-file-name-handler-alist file-name-handler-alist)
    (setq file-name-handler-alist nil)
    ;; Restore `file-name-handler-alist' later, because it is needed for handling
    ;; encrypted or compressed files, among other things.
    (defun doom-reset-file-handler-alist-h ()
      ;; Re-add rather than `setq', because changes to `file-name-handler-alist'
      ;; since startup ought to be preserved.
      (dolist (handler file-name-handler-alist)
	(add-to-list 'doom--initial-file-name-handler-alist handler))
      (setq file-name-handler-alist doom--initial-file-name-handler-alist))
    (add-hook 'emacs-startup-hook #'doom-reset-file-handler-alist-h)
    (add-hook 'after-init-hook (lambda ()
				 ;; restore after startup
				 (setq gc-cons-threshold 16777216
				       gc-cons-percentage 0.1))))

  ;; Ensure Doom is running out of this file's directory
  (setq user-emacs-directory (file-truename (file-name-directory load-file-name)))
#+END_SRC

** init.el: load modules

#+BEGIN_SRC emacs-lisp :tangle init.el
  (add-to-list 'load-path (expand-file-name "lisp" user-emacs-directory))

  (let ((file-name-handler-alist nil)
	(gc-cons-threshold 100000000))
    (load "init-core")
    (load "init-keybindings")
    (load "init-evil")
    (load "init-ui")
    (load "init-window")
    (load "init-navigation")
    (load "init-completion")
    (load "init-org")
    (load "init-writing")
    (load "init-prog")
    (load "init-apps")
    )
#+END_SRC

** init.el: measure startup

#+begin_src emacs-lisp :tangle init.el
  (add-hook 'emacs-startup-hook
	    (lambda ()
	      (message "Emacs started in %s with %d garbage collections."
		       (format "%.3f seconds"
			       (float-time
				(time-subtract after-init-time before-init-time)))
		       gcs-done)))
#+end_src

* Package manager
:PROPERTIES:
:header-args: :tangle lisp/init-core.el
:END:

** bootstrap straight and straight-use-package

#+BEGIN_SRC emacs-lisp
  (setq straight-use-package-by-default t)
  (setq straight-vc-git-default-clone-depth 1)
  (setq straight-recipes-gnu-elpa-use-mirror t)
  (setq straight-check-for-modifications nil)

  (defvar bootstrap-version)
  (let ((bootstrap-file
	 (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
	(bootstrap-version 6))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
	  (url-retrieve-synchronously
	   "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
	   'silent 'inhibit-cookies)
	(goto-char (point-max))
	(eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  (straight-use-package 'use-package)

  (setq comp-deferred-compilation-black-list nil)
#+END_SRC

** Enable use-package statistics

#+BEGIN_SRC emacs-lisp
  (setq use-package-compute-statistics t)
  ;; (setq use-package-verbose t)
#+END_SRC

* Core
:PROPERTIES:
:header-args: :tangle lisp/init-core.el
:END:

** Sane defaults

#+BEGIN_SRC emacs-lisp
  (use-package emacs
    :custom
    (user-full-name "John Downey")
    (user-mail-address "jdowney@gmail.com")

    (inhibit-startup-screen t)
    (initial-scratch-message nil)

    (sentence-end-double-space nil)
    (ring-bell-function 'ignore)
    (ad-redefinition-action 'accept)
    (frame-resize-pixelwise t)
    (vc-follow-symlinks t)

    (custom-file (make-temp-file ""))
    (make-backup-files nil)
    (auto-save-default nil)
    (create-lockfiles nil)

    (byte-compile-warnings '(not free-vars unresolved noruntime lexical make-local))
    (native-comp-async-report-warnings-errors nil)

    (column-number-mode t)
    (tab-always-indent 'complete)
    :init
    (defalias 'yes-or-no-p 'y-or-n-p)

    ;; default to utf-8 for all the things
    (set-charset-priority 'unicode)
    (setq locale-coding-system 'utf-8
	  coding-system-for-read 'utf-8
	  coding-system-for-write 'utf-8)
    (set-terminal-coding-system 'utf-8)
    (set-keyboard-coding-system 'utf-8)
    (set-selection-coding-system 'utf-8)
    (prefer-coding-system 'utf-8)
    (setq default-process-coding-system '(utf-8-unix . utf-8-unix))

    (delete-selection-mode 1)
    (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
    (winner-mode 1)
    (show-paren-mode 1)
    (display-time-mode -1))
#+END_SRC

** On hooks

#+begin_src emacs-lisp
  (use-package on
    :demand
    :straight (:host github :repo "ajgrf/on.el"))
#+end_src

** Private configuration

#+begin_src emacs-lisp
  (add-hook
   'after-init-hook
   (lambda ()
     (let ((private-file (concat user-emacs-directory "private.el")))
       (when (file-exists-p private-file)
	 (load-file private-file)))))
#+end_src

** Zoom

#+BEGIN_SRC emacs-lisp
  (use-package emacs
    :init
    (global-set-key (kbd "C-=") 'text-scale-increase)
    (global-set-key (kbd "C--") 'text-scale-decrease))
#+END_SRC

** macOS

#+BEGIN_SRC emacs-lisp
  (use-package emacs
    :init
    (when (eq system-type 'darwin)
      (setq mac-command-modifier 'super)     ; command as super
      (setq mac-option-modifier 'meta)     ; alt as meta
      (setq mac-control-modifier 'control))

    ;; when on emacs-mac
    (when (fboundp 'mac-auto-operator-composition-mode)
      (mac-auto-operator-composition-mode)   ;; enables font ligatures
      (global-set-key [(s c)] 'kill-ring-save)
      (global-set-key [(s v)] 'yank)
      (global-set-key [(s x)] 'kill-region)
      (global-set-key [(s q)] 'kill-emacs)))
#+END_SRC

** Garbage collector magic hack

#+BEGIN_SRC emacs-lisp
  (use-package gcmh
    :config
    (gcmh-mode 1))
#+END_SRC

** Helpful

#+begin_src emacs-lisp
  (use-package helpful
    :bind
    ([remap describe-function] . helpful-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . helpful-variable)
    ([remap describe-key] . helpful-key))
#+end_src

** Save recent files

#+begin_src emacs-lisp
  (use-package recentf
    :straight (:type built-in)
    :hook
    (on-first-file . recentf-mode)
    :custom
    (recentf-exclude `(,(expand-file-name "straight/build/" user-emacs-directory)
		       ,(expand-file-name "eln-cache/" user-emacs-directory)
		       ,(expand-file-name "etc/" user-emacs-directory)
		       ,(expand-file-name "var/" user-emacs-directory))))
#+end_src

** Highlight trailing whitespace

#+begin_src emacs-lisp
  (dolist (hook '(prog-mode-hook text-mode-hook))
    (add-hook hook (lambda ())
	      (setq-local show-trailing-whitespace t)))
#+end_src

** Undo

#+begin_src emacs-lisp
  (use-package undo-fu)
#+end_src

** Tramp

#+begin_src emacs-lisp
  (use-package tramp
    :defer 1
    :straight (:type built-in)
    :custom
    (vc-ignore-dir-regexp (format "\\(%s\\)\\|\\(%s\\)"
				  vc-ignore-dir-regexp
				  tramp-file-name-regexp))
    (tramp-default-method "ssh")
    (tramp-auto-save-directory (expand-file-name "tramp-auto-save" user-emacs-directory))
    (tramp-persistency-file-name (expand-file-name "tramp-connection-history" user-emacs-directory))
    (tramp-use-ssh-controlmaster-options nil)
    (remote-file-name-inhibit-cache nil)
    (tramp-ssh-controlmaster-options (concat
				      "-o ControlPath=/tmp/ssh-tramp-%%r@%%h:%%p "
				      "-o ControlMaster=auto -o ControlPersist=yes")))

  (use-package docker-tramp
    :defer 2)
#+end_src

* Keybindings
:PROPERTIES:
:header-args: :tangle lisp/init-keybindings.el
:END:

** General

#+begin_src emacs-lisp
  (defun jtd/find-file-in-emacs ()
    "Find files in the emacs configuration directory"
    (interactive)
    (ido-find-file-in-dir user-emacs-directory))

  (defun jtd/switch-to-scratch-buffer ()
    "Switch to the scratch buffer"
    (interactive)
    (switch-to-buffer "*scratch*"))

  (defun jtd/copy-buffer ()
    "Copy the entire buffer"
    (interactive)
    (mark-whole-buffer)
    (kill-ring-save 0 0 t))

  (defun jtd/kill-other-buffers ()
    "Kill all buffers but the current one.
  Don't mess with special buffers."
    (interactive)
    (dolist (buffer (buffer-list))
      (unless (or (eql buffer (current-buffer)) (not (buffer-file-name buffer)))
	(kill-buffer buffer))))

	(use-package general
		:config
		(general-evil-setup)
	
		(general-create-definer jtd/leader-key
			:states '(normal visual)
			:prefix "SPC"
			:global-prefix "C-SPC")
		(general-create-definer jtd/local-leader-key
			:states '(normal visual motion)
			:prefix ","
			:global-prefix "C-,")

    (general-def '(normal insert visual emacs) "C-@" (general-simulate-key "C-SPC"))

    (jtd/leader-key
      ":" 'execute-extended-command
      "a" '(:ignore t :wk "apps")
      "b" '(:ignore t :wk "buffer")
      "bk" 'kill-buffer-and-window
      "bK" 'jtd/kill-other-buffers
      "bs" 'jtd/switch-to-scratch-buffer
      "bY" 'jtd/copy-buffer
      "f" '(:ignore t :wk "file")
      "ff" '(find-file :wk "find file")
      "fe" '(jtd/find-file-in-emacs :wk "find file in emacs.d")
      "g" '(:ignore t :wk "git")
      "h" '(:ignore t :wk "help")
      "ha" 'apropos-command
      "hf" 'helpful-function
      "hk" 'helpful-key
      "hm" 'helpful-macro
      "ho" 'helpful-symbol
      "hv" 'helpful-variable
      "hx" 'helpful-command
      "p" '(:ignore t :wk "project")
      "s" '(:ignore t :wk "search")
      "sj" '(imenu :wk "jump")
      "t" '(:ignore t :wk "tabs")
      "T" '(:ignore t :wk "toggle")
      "w" '(:ignore t :wk "window"))

    (general-define-key
     :definer 'minor-mode
     :states '(normal motion)
     :keymaps 'outline-minor-mode
     "]h" 'outline-next-visible-heading
     "[h" 'outline-prev-visible-heading))
#+end_src

** Which key

#+begin_src emacs-lisp
  (use-package which-key
    :hook (on-first-input . which-key-mode)
    :custom
    (which-key-idle-delay 1))
#+end_src

** Hydra

#+begin_src emacs-lisp
  (use-package hydra)
#+end_src

* Evil
:PROPERTIES:
:header-args: :tangle lisp/init-evil.el
:END:

** evil mode

#+BEGIN_SRC emacs-lisp
  (use-package evil
    :general
    (jtd/leader-key
      "wv" 'evil-window-vsplit
      "ws" 'evil-window-split)
    (general-imap "C-g" 'evil-normal-state)
    :custom
    ((evil-want-integration t)
     (evil-want-keybinding nil)
     (evil-want-abbrev-expand-on-insert-exit nil)
     (evil-respect-visual-line-mode t)
     (evil-want-C-i-jump nil)
     (evil-want-C-d-scroll t)
     (evil-want-C-u-scroll t)
     (evil-want-C-w-delete nil)
     (evil-want-Y-yank-to-eol t)
     (evil-undo-system 'undo-fu)
     (evil-search-module 'evil-search-module 'evil-search)  ;; enables gn
     (evil-split-window-below t)
     (evil-vsplit-window-right t)
     (evil-auto-indent nil)
     (evil-want-C-w-in-emacs-state t))
    :init
    (evil-mode 1)
    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))
#+END_SRC

** evil-collection

#+BEGIN_SRC emacs-lisp
  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))
#+END_SRC

