readme.org
** Surround

#+begin_src emacs-lisp
  (use-package evil-surround
    :after evil
    :hook
    (on-first-input . global-evil-surround-mode))
#+end_src

** Preview registers

#+begin_src emacs-lisp
  (use-package evil-owl
    :hook
    (on-first-input . evil-owl-mode)
    :custom
    (evil-owl-max-string-length 500)
    (evil-owl-display-method 'window))
#+end_src

* UI
:PROPERTIES:
:header-args: :tangle lisp/init-ui.el
:END:

** Theme

#+BEGIN_SRC emacs-lisp
  (load-theme 'modus-vivendi t)
#+END_SRC

** Font

#+begin_src emacs-lisp
  (set-face-attribute 'default nil :font "Fira Code" :height 160)
  (set-face-attribute 'variable-pitch nil :font "Fira Sans" :height 160)
#+end_src

** Highlight current line

#+begin_src emacs-lisp
  (global-hl-line-mode 1)
#+end_src

** Highlight indentation guides

#+begin_src emacs-lisp
  (use-package highlight-indent-guides
    :hook (prog-mode . highlight-indent-guides-mode)
    :custom
    (highlight-indent-guides-method 'character)
    (highlight-indent-guides-responsive 'top))
#+end_src

** Doom modeline

#+BEGIN_SRC emacs-lisp
  (use-package doom-modeline
    :hook
    (on-init-ui . doom-modeline-mode)
    :custom
    (doom-modeline-buffer-encoding nil)
    (doom-modeline-env-enable-python nil)
    (doom-modeline-height 15)
    (doom-modeline-project-detection 'projectile))
#+END_SRC

** All the icons

#+begin_src emacs-lisp
  (use-package all-the-icons)
#+end_src

** Icons in the terminal

#+begin_src emacs-lisp
  (use-package icons-in-terminal
    :straight (:host github :repo "seagle0128/icons-in-terminal.el")
    :if (not (display-graphic-p))
    :config
    (defalias #'all-the-icons-insert #'icons-in-terminal-insert)
    (defalias #'all-the-icons-insert-faicon #'icons-in-terminal-insert-faicon)
    (defalias #'all-the-icons-insert-fileicon #'icons-in-terminal-insert-fileicon)
    (defalias #'all-the-icons-insert-material #'icons-in-terminal-insert-material)
    (defalias #'all-the-icons-insert-octicon #'icons-in-terminal-insert-octicon)
    (defalias #'all-the-icons-insert-wicon #'icons-in-terminal-insert-wicon)
    (defalias #'all-the-icons-icon-for-dir #'icons-in-terminal-icon-for-dir)
    (defalias #'all-the-icons-icon-for-file #'icons-in-terminal-icon-for-file)
    (defalias #'all-the-icons-icon-for-mode #'icons-in-terminal-icon-for-mode)
    (defalias #'all-the-icons-icon-for-url #'icons-in-terminal-icon-for-url)
    (defalias #'all-the-icons-icon-family #'icons-in-terminal-icon-family)
    (defalias #'all-the-icons-icon-family-for-buffer #'icons-in-terminal-icon-family-for-buffer)
    (defalias #'all-the-icons-icon-family-for-file #'icons-in-terminal-icon-family-for-file)
    (defalias #'all-the-icons-icon-family-for-mode #'icons-in-terminal-icon-family-for-mode)
    (defalias #'all-the-icons-icon-for-buffer #'icons-in-terminal-icon-for-buffer)
    (defalias #'all-the-icons-faicon #'icons-in-terminal-faicon)
    (defalias #'all-the-icons-octicon #'icons-in-terminal-octicon)
    (defalias #'all-the-icons-fileicon #'icons-in-terminal-fileicon)
    (defalias #'all-the-icons-material #'icons-in-terminal-material)
    (defalias #'all-the-icons-wicon #'icons-in-terminal-wicon)
    (defalias 'all-the-icons-default-adjust 'icons-in-terminal-default-adjust)
    (defalias 'all-the-icons-color-icons 'icons-in-terminal-color-icons)
    (defalias 'all-the-icons-scale-factor 'icons-in-terminal-scale-factor)
    (defalias 'all-the-icons-icon-alist 'icons-in-terminal-icon-alist)
    (defalias 'all-the-icons-dir-icon-alist 'icons-in-terminal-dir-icon-alist)
    (defalias 'all-the-icons-weather-icon-alist 'icons-in-terminal-weather-icon-alist))
#+end_src

** Ligatures

#+begin_src emacs-lisp
  (use-package ligature
    :straight (:host github :repo "mickeynp/ligature.el")
    :hook (prog-mode . ligature-mode)
    :config
    (ligature-set-ligatures 't '("www" "ff" "fi" "ffi"))
    (ligature-set-ligatures 'prog-mode '("|||>" "<|||" "<==>" "<!--" "####" "~~>" "***" "||=" "||>"
					 ":::" "::=" "=:=" "===" "==>" "=!=" "=>>" "=<<" "=/=" "!=="
					 "!!." ">=>" ">>=" ">>>" ">>-" ">->" "->>" "-->" "---" "-<<"
					 "<~~" "<~>" "<*>" "<||" "<|>" "<$>" "<==" "<=>" "<=<" "<->"
					 "<--" "<-<" "<<=" "<<-" "<<<" "<+>" "</>" "###" "#_(" "..<"
					 "..." "+++" "/==" "///" "_|_" "www" "&&" "^=" "~~" "~@" "~="
					 "~>" "~-" "**" "*>" "*/" "||" "|}" "|]" "|=" "|>" "|-" "{|"
					 "[|" "]#" "::" ":=" ":>" ":<" "$>" "==" "=>" "!=" "!!" ">:"
					 ">=" ">>" ">-" "-~" "-|" "->" "--" "-<" "<~" "<*" "<|" "<:"
					 "<$" "<=" "<>" "<-" "<<" "<+" "</" "#{" "#[" "#:" "#=" "#!"
					 "##" "#(" "#?" "#_" "%%" ".=" ".-" ".." ".?" "+>" "++" "?:"
					 "?=" "?." "??" ";;" "/*" "/=" "/>" "//" "__" "~~" "(*" "*)"
					 "\\\\" "://")))
#+end_src

** Pretty symbols

#+begin_src emacs-lisp
  (global-prettify-symbols-mode 1)
#+end_src

** Hide modeline

#+begin_src emacs-lisp
  (use-package hide-mode-line
    :commands hide-mode-line)
#+end_src

** Show end of file

#+begin_src emacs-lisp
  (use-package vi-tilde-fringe
    :if (display-graphic-p)
    :hook (prog-mode . vi-tilde-fringe-mode))
#+end_src

** Emoji

#+begin_src emacs-lisp
  (use-package emojify
    :hook
    (on-init-ui . global-emojify-mode)
    :config
    (delete 'mu4e-headers-mode emojify-inhibit-major-modes))
#+end_src

** Fill column indicator

#+begin_src emacs-lisp
  (use-package display-fill-column-indicator
    :straight (:type built-in)
    :hook
    (prog-mode . display-fill-column-indicator-mode)
    :custom
    (fill-column 120))
#+end_src

** Dashboard

#+begin_src emacs-lisp
  (use-package dashboard
    :custom
    (dashboard-project-backend 'projectile)
    (dashboard-set-heading-icons t)
    (dashboard-set-file-icons t)
    (dashboard-banner-logo-title nil)
    (dashboard-set-footer nil)
    (dashboard-items '((agenda . 5)
		       (recents . 5)
		       (projects . 5)))
    :config
    (dashboard-setup-startup-hook))
#+end_src

* Window management
:PROPERTIES:
:header-args: :tangle lisp/init-window.el
:END:

** Disable built in

#+begin_src emacs-lisp
  (tab-bar-mode -1)
  (tab-line-mode -1)

	(global-unset-key (kbd "C-<tab>"))
#+end_src

** Golden ratio

#+begin_src emacs-lisp
  (use-package golden-ratio
    :hook
    (on-first-buffer . golden-ratio-mode)
    :custom
    (golden-ratio-exclude-modes '(treemacs-mode imenu-list-major-mode))
    (golden-ratio-extra-commands
     '(windmove-left
       windmove-right
       windmove-down
       windmove-up
       evil-window-left
       evil-window-right
       evil-window-up
       evil-window-down
       buf-move-left
       buf-move-right
       buf-move-up
       buf-move-down
       window-number-select
       select-window
       select-window-1
       select-window-2
       select-window-3
       select-window-4
       select-window-5
       select-window-6
       select-window-7
       select-window-8
       select-window-9)))
#+end_src

** Transpose frame

#+begin_src emacs-lisp
  (use-package transpose-frame
    :general
    (jtd/leader-key
      "wt" '(transpose-frame :wk "transpose")
      "wf" '(rotate-frame :wk "flip")))
#+end_src

** Perspective

#+begin_src emacs-lisp
	(use-package perspective
		:demand
		:after consult
		:custom
		(persp-state-default-file (expand-file-name ".persp" user-emacs-directory))
		(persp-mode-prefix-key (kbd "C-c M-p"))
		:general
		(jtd/leader-key
			"TAB" '(:ignore true :wk "tab")
			"TAB TAB" 'persp-switch
			"TAB `" 'persp-switch-last
			"TAB d" 'persp-kill
			"TAB h" 'persp-prev
			"TAB l" 'persp-next
			"TAB x" '((lambda () (interactive) (persp-kill (persp-current-name))) :wk "kill current")
			"TAB X" '((lambda () (interactive) (persp-kill (persp-names))) :wk "kill all"))
		:init
		:config
		(persp-mode)
		(consult-customize consult--source-buffer :hidden t :default nil)
		(add-to-list 'consult-buffer-sources persp-consult-source)
		(add-hook 'kill-emacs-hook #'persp-state-save))
#+end_src

* Navigation
:PROPERTIES:
:header-args: :tangle lisp/init-navigation.el
:END:

** Ranger

#+begin_src emacs-lisp
  (use-package ranger
    :custom
    (ranger-key "zp")
    :general
    (jtd/leader-key
      "ar" 'ranger))
#+end_src

** dired

#+begin_src emacs-lisp
	(use-package dired
		:straight (:type built-in)
		:general
		(jtd/leader-key
			"ad" 'dired)
		(general-nmap
			"-" 'dired-jump)
		(general-nmap dired-mode-map
									"SPC" nil
									"c" 'find-file)
		:config
		(require 'dired-x))
#+end_src

** Treemacs

#+begin_src emacs-lisp
  (use-package treemacs
    :custom
    ((treemacs-project-follow-mode t)
     (treemacs-follow-mode t)
     (treemacs-filewatch-mode t))
    :general
    (jtd/leader-key
      "fd" 'treemacs-find-file
      "ft" 'treemacs))

  (use-package treemacs-evil
    :after (treemacs evil))

  (use-package treemacs-projectile
    :after (treemacs projectile))

  (use-package treemacs-icons-dired
    :hook (dired-mode . treemacs-icons-dired-enable-once))

  (use-package treemacs-magit
    :after (treemacs magit))
#+end_src

* Completion
:PROPERTIES:
:header-args: :tangle lisp/init-completion.el
:END:

** Ignore case

#+begin_src emacs-lisp
  (setq read-buffer-completion-ignore-case t
	read-file-name-completion-ignore-case t
	completion-ignore-case t)
#+end_src

