lisp/init-completion.el
;; [[file:../readme.org::*Ignore case][Ignore case:1]]
(setq read-buffer-completion-ignore-case t
      read-file-name-completion-ignore-case t
      completion-ignore-case t)
;; Ignore case:1 ends here
