lisp/init-evil.el

;; [[file:../readme.org::*Surround][Surround:1]]
(use-package evil-surround
  :after evil
  :hook
  (on-first-input . global-evil-surround-mode))
;; Surround:1 ends here

;; [[file:../readme.org::*Preview registers][Preview registers:1]]
(use-package evil-owl
  :hook
  (on-first-input . evil-owl-mode)
  :custom
  (evil-owl-max-string-length 500)
  (evil-owl-display-method 'window))
;; Preview registers:1 ends here
