readme.org
** Vertico

#+begin_src emacs-lisp
  (use-package vertico
    :demand
    :straight (:files (:defaults "extensions/*"))
    :bind (:map vertico-map
		("C-j" . vertico-next)
		("C-k" . vertico-previous)
		("C-l" . vertico-insert)
		:map minibuffer-local-map
		("M-h" . backward-kill-word))
    :custom
    (vertico-cycle t)
    :config
    (vertico-mode 1)
    (advice-add #'vertico--format-candidate :around
		(lambda (orig cand prefix suffix index _start)
		  (setq cand (funcall orig cand prefix suffix index _start))
		  (concat
		   (if (= vertico--index index)
		       (propertize "» " 'face 'vertico-current)
		     "  ")
		   cand))))

  (use-package vertico-directory
    :after vertico
    :straight nil
    :bind (:map vertico-map
		("RET" . vertico-directory-enter)
		("DEL" . vertico-directory-delete-char)
		("M-DEL" . vertico-directory-delete-word))
    :hook (rfn-eshadow-update-overlay . vertico-directory-tidy))
#+end_src

** Save history

#+begin_src emacs-lisp
  (use-package savehist
    :after vertico
    :hook
    (on-first-input . savehist-mode))
#+end_src

** Consult

#+begin_src emacs-lisp
  (use-package consult
    :general
    (jtd/leader-key
      "bb" 'consult-buffer
      "fr" 'consult-recent-file
      "pb" 'consult-project-buffer
      "so" 'consult-outline
      "si" 'consult-isearch
      "sr" 'consult-ripgrep
      "ss" 'consult-line)
    :init
    (setq xref-show-xrefs-function #'consult-xref
	  xref-show-definitions-function #'consult-xref)
    :config
    (autoload 'projectile-project-root "projectile")
    (setq consult-project-root-function #'projectile-project-root))
#+end_src

** Embark

#+begin_src emacs-lisp
  (use-package embark
    :bind
    (("C-." . embark-act)
     ("C-;" . embark-dwim)
     ("C-h B" . embark-bindings))
    :init
    (setq prefix-help-command #'embark-prefix-help-command)
    :config
    (add-to-list 'display-buffer-alist
		 '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
		   nil
		   (window-parameters (mode-line-format . none)))))

  (use-package embark-consult
    :after (embark consult)
    :demand t
    :hook
    (embark-collect-mode . consult-preview-at-point-mode))
#+end_src

** Marginalia

#+begin_src emacs-lisp
  (use-package marginalia
    :after vertico
    :hook
    (on-first-input . marginalia-mode))
#+end_src

** Better search matching

#+begin_src emacs-lisp
  (use-package fussy
    :after vertico
    :config
    (push 'fussy completion-styles)
    (setq completion-category-defaults nil
	  completion-category-overrides nil))

  (use-package orderless
    :after fussy
    :commands orderless-filter
    :init
    (setq fussy-filter-fn 'fussy-filter-orderless))
#+end_src

** Corfu

#+begin_src emacs-lisp
  (use-package corfu
    :hook ((prog-mode . corfu-mode)
	   (org-mode . corfu-mode))
    :bind
    (:map corfu-map
	  ("C-j" . corfu-next)
	  ("C-k" . corfu-previous))
    :general
    (evil-insert-state-map "C-k" nil)
    :custom
    (corfu-auto nil)
    (corfu-cycle t)
    (corfu-min-width 80)
    (corfu-max-width corfu-min-width)
    (corfu-preselect-first t)
    :init
    (defun corfu-enable-always-in-minibuffer ()
      "Enable Corfu in the minibuffer if Vertico/Mct are not active."
      (unless (or (bound-and-true-p mct--active) ; Useful if I ever use MCT
		  (bound-and-true-p vertico--input))
	(setq-local corfu-auto nil)       ; Ensure auto completion is disabled
	(corfu-mode 1)))
    (add-hook 'minibuffer-setup-hook #'corfu-enable-always-in-minibuffer 1))

  (use-package corfu-terminal
    :if (not (display-graphic-p))
    :config
    (corfu-terminal-mode +1))
#+end_src

** Kind icon

#+begin_src emacs-lisp
  (use-package kind-icon
    :after corfu
    :custom
    (kind-icon-default-face 'corfu-default)
    :config
    (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))
#+end_src

* Org
:PROPERTIES:
:header-args: :tangle lisp/init-org.el
:END:

** Org mode

#+begin_src emacs-lisp
  (use-package org
    :hook
    (org-mode . variable-pitch-mode)
    (org-mode . visual-line-mode)
    :general
    (jtd/leader-key
      "o" '(:ignore t :wk "org")
      "oa" 'org-agenda-list
      "oc" 'org-capture
      "om" 'org-tags-view
      "oo" 'org-agenda
      "ot" 'org-todo-list)
    :custom
    ((org-agenda-files '("~/org/inbox.org"
			 "~/org/projects.org"
			 "~/org/tickler.org"))
     (org-refile-targets '(("~/org/projects.org" :maxlevel . 3)
			   ("~/org/someday.org" :level . 1)
			   ("~/org/tickler.org" :maxlevel . 2)))
     (org-todo-keywords '((sequence "TODO(t)" "WAITING(w)" "|" "DONE(d)" "CANCELLED(c)"))))
    :config
    (jtd/local-leader-key :keymaps 'org-mode-map
      "!" 'org-time-stamp-inactive
      "'" 'org-edit-special
      "*" 'org-ctrl-c-star
      "," 'org-ctrl-c-ctrl-c
      "-" 'org-ctrl-c-minus
      "." 'org-time-stamp
      "/" 'org-sparse-tree
      ":" 'org-set-tags
      "A" 'org-archive-subtree
      "D" 'org-insert-drawer
      "H" 'org-shiftleft
      "I" 'org-clock-in
      "J" 'org-shiftdown
      "K" 'org-shiftup
      "L" 'org-shiftright
      "N" 'widen
      "O" 'org-clock-out
      "P" 'org-set-property
      "R" 'org-refile
      "Sh" 'org-promote-subtree
      "Sj" 'org-move-subtree-down
      "Sk" 'org-move-subtree-up
      "Sl" 'org-demote-subtree
      "T" 'org-show-todo-tree
      "^" 'org-sort
      "a" 'org-agenda
      "b" 'org-tree-to-indirect-buffer
      "c" 'org-capture
      "d" 'org-deadline
      "e" 'org-export-dispatch
      "f" 'org-set-effort
      "hI" 'org-insert-heading
      "hi" 'org-insert-heading-after-current
      "hs" 'org-insert-subheading
      "ia" 'org-attach
      "if" 'org-footnote-new
      "il" 'org-insert-link
      "l" 'org-open-at-point
      "n" 'org-narrow-to-subtree
      "q" 'org-clock-cancel
      "s" 'org-schedule
      "tE" 'org-table-export
      "tH" 'org-table-move-column-left
      "tI" 'org-table-import
      "tJ" 'org-table-move-row-down
      "tK" 'org-table-move-row-up
      "tL" 'org-table-move-column-right
      "tN" 'org-table-create-with-table.el
      "ta" 'org-table-align
      "tb" 'org-table-blank-field
      "tc" 'org-table-convert
      "tdc" 'org-table-delete-column
      "tdr" 'org-table-kill-row
      "te" 'org-table-eval-formula
      "th" 'org-table-previous-field
      "tiH" 'org-table-hline-and-move
      "tic" 'org-table-insert-column
      "tih" 'org-table-insert-hline
      "tir" 'org-table-insert-row
      "tj" 'org-table-next-row
      "tl" 'org-table-next-field
      "tn" 'org-table-create
      "tr" 'org-table-recalculate
      "ts" 'org-table-sort-lines
      "ttf" 'org-table-toggle-formula-debugger
      "tto" 'org-table-toggle-coordinate-overlays
      "tw" 'org-table-wrap-region
      "RET" 'org-ctrl-c-ret)
    (jtd/local-leader-key
      :definer 'minor-mode
      :keymaps 'org-src-mode
      "c" 'org-edit-src-exit
      "a" 'org-edit-src-abort
      "k" 'org-edit-src-abort)
    (setq org-capture-templates
	  `(("b" "Books")
	    ("bf" "Finished book" table-line
	     (file+headline ,(concat org-directory "/books.org") "Finished")
	     "| %^{Title} | %^{Author} | %u |")
	    ("br" "Book to read" entry
	     (file+headline ,(concat org-directory "/books.org") "To Read")
	     "* %i%?\n")
	    ("g" "GTD")
	    ("gt" "Todo [inbox]" entry
	     (file+headline ,(concat org-directory "/inbox.org") "Tasks")
	     "* TODO %i%?")
	    ("gT" "Tickler" entry
	     (file+headline ,(concat org-directory "/tickler.org") "Tickler")
	     "* %i%? \n %U")
	    ("i" "Ideas")
	    ("ib" "Blog idea" entry
	     (file ,(concat org-directory "/blog-ideas.org"))
	     "* %?\n")
	    )))
#+end_src

** Evil integration

#+begin_src emacs-lisp
  (use-package evil-org
    :hook (org-mode . evil-org-mode)
    :config
    (require 'evil-org-agenda)
    (evil-org-agenda-set-keys)
    (evil-org-set-key-theme '(textobjects
			      insert
			      navigation
			      additional
			      shift
			      todo
			      heading)))
#+end_src

