readme.org
** Structure templates

#+begin_src emacs-lisp
  (use-package org-tempo
    :after org
    :straight nil
    :config
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("py" . "src python"))
    (add-to-list 'org-structure-template-alist '("sh" . "src shell")))
#+end_src

** Modern

#+begin_src emacs-lisp
  (use-package org-modern
    :hook
    (org-mode . org-modern-mode))
#+end_src

* Writing
:PROPERTIES:
:header-args: :tangle lisp/init-writing.el
:END:

** Writeroom

#+begin_src emacs-lisp
  (use-package writeroom-mode
    :general
    (jtd/leader-key "Tw" 'writeroom-mode))
#+end_src

** Darkroom

#+begin_src emacs-lisp
  (use-package darkroom
    :general
    (jtd/leader-key "Td" 'darkroom-tentative-mode))
#+end_src

** Spelling

#+begin_src emacs-lisp
  (use-package flyspell
    :hook
    (text-mode . flyspell-mode)
    (prog-mode . flyspell-prog-mode)
    :custom
    (ispell-program-name "aspell"))

  (use-package flyspell-correct
    :after flyspell
    :bind (:map flyspell-mode-map
		("C-;" . flyspell-correct-wrapper)))
#+end_src

* Programming
:PROPERTIES:
:header-args: :tangle lisp/init-prog.el
:END:

** Line numbers

#+begin_src emacs-lisp
  (add-hook 'prog-mode-hook #'display-line-numbers-mode)
#+end_src

** Version control

*** magit

#+begin_src emacs-lisp
  (use-package magit
    :general
    (jtd/leader-key
      "gb" 'magit-blame
      "gl" 'magit-log
      "gg" 'magit-status
      "gG" 'magit-status-here))
#+end_src

*** Time machine

#+begin_src emacs-lisp
  (use-package git-timemachine
    :straight (:package "git-timemachine"
			:type git
			:host nil
			:repo "https://codeberg.org/pidu/git-timemachine.git")
    :hook
    (git-time-machine-mode . evil-normalize-keymaps)
    :custom
    (git-timemachine-show-minibuffer-details t)
    :general
    (jtd/leader-key
      "gt" 'git-timemachine)
    (git-timemachine-mode-map
     "C-k" 'git-timemachine-show-previous-revision
     "C-j" 'git-timemachine-show-next-revision
     "q" 'git-timemachine-quit))
#+end_src

*** Highlight uncommitted changes

#+begin_src emacs-lisp
  (use-package diff-hl
    :hook (((prog-mode text-mode vc-dir-mode) . diff-hl-mode)
	   (magit-pre-refresh . diff-hl-magit-pre-refresh)
	   (magit-post-refresh . diff-hl-magit-post-refresh)))
#+end_src

*** smerge

#+begin_src emacs-lisp
  (use-package smerge-mode
    :straight (:type built-in)
    :after hydra
    :general
    (jtd/leader-key "gm" 'smerge-hydra/body)
    :hook
    (magit-diff-visit-file . (lambda ()
			       (when smerge-mode
				 (smerge-hydra/body))))
    :init
    (defhydra smerge-hydra (:hint nil
				  :pre (smerge-mode 1)
				  :post (smerge-auto-leave))
      "
																										  ╭────────┐
	  Movement   Keep           Diff              Other │ smerge │
	  ╭─────────────────────────────────────────────────┴────────╯
		   ^_g_^       [_b_] base       [_<_] upper/base    [_C_] Combine
		   ^_C-k_^     [_u_] upper      [_=_] upper/lower   [_r_] resolve
		   ^_k_ ↑^     [_l_] lower      [_>_] base/lower    [_R_] remove
		   ^_j_ ↓^     [_a_] all        [_H_] hightlight
		   ^_C-j_^     [_RET_] current  [_E_] ediff             ╭──────────
		   ^_G_^                                            │ [_q_] quit"
      ("g" (progn (goto-char (point-min)) (smerge-next)))
      ("G" (progn (goto-char (point-max)) (smerge-prev)))
      ("C-j" smerge-next)
      ("C-k" smerge-prev)
      ("j" next-line)
      ("k" previous-line)
      ("b" smerge-keep-base)
      ("u" smerge-keep-upper)
      ("l" smerge-keep-lower)
      ("a" smerge-keep-all)
      ("RET" smerge-keep-current)
      ("\C-m" smerge-keep-current)
      ("<" smerge-diff-base-upper)
      ("=" smerge-diff-upper-lower)
      (">" smerge-diff-base-lower)
      ("H" smerge-refine)
      ("E" smerge-ediff)
      ("C" smerge-combine-with-next)
      ("r" smerge-resolve)
      ("R" smerge-kill-current)
      ("q" nil :color blue)))
#+end_src

** Project management

#+begin_src emacs-lisp
	(use-package projectile
		:hook
		(after-init . projectile-mode)
		:general
		(jtd/leader-key
			"p" '(:keymap projectile-command-map :wk "projectile"))
		(general-nmap dired-mode-map
			"_" 'projectile-dired)
		:custom ((projectile-project-search-path '("~/code"))
						 (projectile-switch-project-action #'projectile-dired)))
#+end_src

** Comments

#+begin_src emacs-lisp
  (use-package evil-commentary
    :hook (prog-mode . evil-commentary-mode))
#+end_src

** Treat _ as part of a word like vim

#+begin_src emacs-lisp
  (add-hook 'prog-mode-hook (lambda () (modify-syntax-entry ?_ "w")))
#+end_src

** Delete trailing white space

#+begin_src emacs-lisp
  (add-hook 'before-save-hook
	    (lambda ()
	      (when (derived-mode-p 'prog-mode)
		(whitespace-cleanup))))
#+end_src

** Terminal emulation

#+begin_src emacs-lisp
  (use-package vterm
    :general
    (jtd/leader-key
      "'" 'vterm))

  (use-package vterm-toggle
    :general
    (jtd/leader-key
      "`" 'vterm-toggle-cd))
#+end_src

** Completion

#+begin_src emacs-lisp
  (use-package company
    :hook (prog-mode . company-mode)
    :custom
    (company-minimum-prefix-length 1))
#+end_src

** Formatting

#+begin_src emacs-lisp
  (use-package apheleia
    :hook
    (on-first-file . apheleia-global-mode))
#+end_src

** Tree sitter

#+begin_src emacs-lisp
  (use-package tree-sitter
    :hook
    (on-first-buffer . global-tree-sitter-mode)
    (tree-sitter-after-on-hook . tree-sitter-hl-mode))

  (use-package tree-sitter-langs
    :after tree-sitter)
#+end_src

** Rainbow Delimiters

#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

** Smartparens

#+begin_src emacs-lisp
  (use-package smartparens
    :hook (prog-mode . smartparens-mode))
#+end_src

** Lisps

*** Lispy

#+begin_src emacs-lisp
  (use-package lispy
    :hook (emacs-lisp-mode . lispy-mode))
#+end_src

*** Lispyville

#+begin_src emacs-lisp
  (use-package lispyville
    :hook (lispy-mode . lispyville-mode)
    :config
    (lispyville-set-key-theme '((operators normal)
				c-w
				(prettify insert)
				(atom-movement t)
				slurp/barf-lispy
				additional
				additional-insert)))
#+end_src
* Apps
:PROPERTIES:
:header-args: :tangle lisp/init-apps.el
:END:

** Notes

#+begin_src emacs-lisp
  (use-package deft
    :general
    (jtd/leader-key
      "n" '(:ignore t :wk "notes")
      "nf" 'deft-find-file
      "nv" 'deft)
    (jtd/local-leader-key :keymaps 'deft-mode-map
      "c" 'deft-filter-clear
      "d" 'deft-delete-file
      "i" 'deft-toggle-incremental-search
      "n" 'deft-new-file
      "r" 'deft-rename-file)
    :config
    (evil-set-initial-state 'deft-mode 'insert)

    (setq deft-default-extension "org"
	  deft-directory "~/notes"
	  deft-use-filename-as-title nil
	  deft-use-filter-string-for-filename t))
#+end_src

** Email

*** mu4e

#+begin_src emacs-lisp
  (use-package mu4e
    :straight nil
    :custom
    (mu4e-headers-fields '((:human-date . 12)
			   (:flags . 6)
			   (:from . 22)
			   (:subject)))
    :general
    (jtd/leader-key
      "am" 'mu4e))
#+end_src

*** org-msg

#+begin_src emacs-lisp
  (use-package org-msg
    :after mu4e)
#+end_src

** RSS

#+begin_src emacs-lisp
  (use-package elfeed
    :custom
    (elfeed-sort-order 'ascending)
    :general
    (jtd/leader-key
      "af" 'elfeed))

  (use-package elfeed-protocol
    :after elfeed
    :config
    (elfeed-protocol-enable))
#+end_src

** IRC

#+begin_src emacs-lisp
  (use-package circe
    :custom
    (circe-reduce-lurker-spam t)
    :general
    (jtd/leader-key
      "ac" 'circe)
    :config
    (enable-circe-color-nicks))
#+end_src
