lisp/init-org.el

;; [[file:../readme.org::*Structure templates][Structure templates:1]]
(use-package org-tempo
  :after org
  :straight nil
  :config
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("sh" . "src shell")))
;; Structure templates:1 ends here

;; [[file:../readme.org::*Modern][Modern:1]]
(use-package org-modern
  :hook
  (org-mode . org-modern-mode))
;; Modern:1 ends here
